<template>
  <q-card>
    <q-card-section>
      <div class="row items-center">
        <div class="text-h6">隱私權政策</div>
        <q-btn flat icon="close" class="q-ml-auto" @click="closeDialog" />
      </div>
    </q-card-section>

    <q-separator />

    <q-card-section style="max-height: 90vh" class="scroll">
      <div class="text-h6 text-bold q-py-md">
        一、訂定隱私權保護政策之初衷：
      </div>
      <div>
        1.東元資融股份有限公司及其指定人(東元金融科技股份有限公司、東元機車有限公司、東元騰有限公司、波波金融科技股份有限公司等，以下合稱本公司)為提供更安全更快速方法，滿足消費者﹝下稱您﹞分期購物之需求，您可以利用手機或電腦連加本公司官方Line平台﹝下稱本平台﹞，讓本公司提供服務，滿足您的需求，因此關於您的隱私權保護，本公司相當重視，為更強化個人資料保護，讓您於安全無虞之交易平台，享受購物的樂趣，特訂定隱私權保護政策(以下稱本政策)，請您詳閱以下事項。
      </div>
      <div>
        2.當您進入連加本平台並註冊使用本平台之各項服務(包括但不限於瀏覽本平台、本平台活動或服務、線上申請、線上簽約等)時，本公司依本政策蒐集、處理、利用與國際傳輸您所提供之個人資料。您於使用本平台或點選同意本政策時均已清楚瞭解及知悉本公司蒐集、處理、利用或國際傳輸您本人個人資料之目的及用途，並同意以電子文件方式表示及電子簽章同意本政策之內容，且您提供與本公司之資料若包含您以外第三人之個人資料時，視為您已以適當方式使該第三人知悉其個人資料會提供與本公司於本政策範圍內，進行蒐集、處理、利用或國際傳輸。如本公司委託其他成員提供服務之任何部分，本公司得將個人資料提供予該其他成員。本公司應促使其他成員遵守本隱私權政策，以保護您的個人資料。本公司得將本公司蒐集之全部或部分個人資料，委託其他業者處理及利用。在此情形下，本公司將充分審查受託業者之資格以及其對於個人資料安全之維護措施，並於相關契約中規定其所應盡之保密義務等事項，以保障個人資料安全。
      </div>
      <div>
        3.藉由註冊使用我們提供的本服務，您同意並贊成本公司，以及其各自之代表人及/或代理人，得相互蒐集、使用、揭露及分享您的個人資料，並得依本政策所載方式，揭露該個人資料予本公司授權之服務提供者及相關第三人。
      </div>
      <div>
        4.若您未達法定成年年齡，除應符合本政策規定外，並應於您的家長（或監護人）閱讀、瞭解並同意本政策之所有內容及其後修改變更後，方得使用或繼續使用。當您使用或繼續使用本服務時，即表示您的家長（或監護人）已閱讀、瞭解並同意接受本政策之所有內容及其後修改變更。
      </div>

      <!--  -->

      <div class="text-h6 text-bold q-py-md">二、個人資料蒐集之目的：</div>
      <div>
        1.辦理分期付款買賣、融資性租賃及應收帳款受讓等相關業務；帳務管理及債權交易業務。
      </div>
      <div>
        2.為履行法定義務、契約義務、提供各項服務，以及遵守金融監理、司法、稅賦與其他依法具有司法或行政調查權公務機關之命令及查核。
      </div>
      <div>
        3.本公司業務及行政管理，以及訴訟、非訟及仲裁或其他紛爭事件之處理；或其他法令許可之事由或目的。
      </div>
      <div>
        4.依本項業務往來之目的及本公司營業項目或章程所訂業務需要等特定目的內，得蒐集、處理、利用及國際傳遞申請人、連帶保證人之個人資料。
      </div>

      <!--  -->

      <div class="text-h6 text-bold q-py-md">三、蒐集之個人資料類別：</div>
      <div>
        依個人資料保護法第二條第一項定義之個人資料，詳如相關業務申請書或約定書內容。
      </div>

      <!--  -->

      <div class="text-h6 text-bold q-py-md">
        四、個人資料利用期間、地區、對象、及方式：
      </div>
      <div>
        1.期間：個人資料搜集之特定目的存續期間，依相關法令或契約約定之保存年限或本公司因執行業務所必須之保存期間。
      </div>
      <div>
        2.地區：中華民國境內、本公司營業所在地、國際傳輸個人資料之接收者所在地及本公司業務委外機構所在地、與本公司有業務往來之機構營業處所所在地。
      </div>
      <div>
        3.對象：本公司及其指定之債權受讓人或其他第三人、金融監理、司法、稅務與其他依法具有調查權之公務機關，及受該等機構委託行使相關監管權力之機構（包括但不限於台灣證券交易所及證券櫃臺買賣中心）、同業公會、未受中央目的事業主管機關限制之國際傳輸個人資料之接收者、本公司之共同行銷或合作推廣對象、其他與本公司有業務往來之機構。
      </div>
      <div>
        4.方式：符合個人資料相關法令以自動化機器﹝例如電腦﹞或其他非自動化方式﹝例如紙本﹞之利用方式（例如使用電子文件、書面、電話、傳真或其他合於當時科技之適當方式）或符合個人資料保護法第20
        條規定之利用。
      </div>
      <div>
        5.依個資法第三條規定，您就本公司保有之個人資料得行使下列權利：得向本公司查詢、得請求閱覽或請求製給複製本、請求補充或更正、請求停止蒐集、處理或利用及請求刪除，但本公司得視需要酌收必要成本費用，依法因執行業務所必須者，得不依您請求為之。
      </div>
      <div>
        6.不提供個人資料所致權益影響：您得自由選擇是否提供個人資料，惟若拒絕提供，本公司將無法進行必要之審核及處理作業，致無法提供相關服務。
      </div>

      <!--  -->

      <div class="text-h6 text-bold q-py-md">
        五、本公司採取適當之安全維護措施：
      </div>
      <div>
        1.本公司會將您的個人資料，以當時科技之適當方式及保護措施完整保存於我們的資料儲存系統中，防止未經授權人員接觸，以保障您的個人資料不會被不當取得或破壞。本公司管理人員均受過完整資訊保密教育，如有違反保密義務者，將受相關法律及公司內部規定之處分。如因業務需要有必要委託第三人提供服務時，亦會要求其確實遵守相關保密義務。
      </div>
      <div>
        2.本平台的網頁或功能可能提供其他網站的網路連結，您也可能經由本平台所提供的連結，點選進入其他網站或應用程式，這些連結網站或應用程式可能蒐集您的個人資料，並有其各自的隱私權政策，本政策不適用於這些連結網站或應用程式以及其資料處理措施，本平台亦不保護您於該連結網站中的隱私權。
      </div>
      <div>
        3.請您妥善保管密碼及或任何個人資料，不要將任何個人資料(尤其是密碼)提供給任何人。並請在您於本平台完成您所欲執行之程序或動作後，務必記得登出帳戶，若您是與他人共享電腦或使用公共電腦等設備，切記要關閉瀏覽器視窗，以防止他人讀取您的個人資料或信件。
      </div>
      <div>
        4.Cookie之使用:為了方便您的使用及提供更佳的服務，本平台會在您所使用的電腦、手機等設備中寫入並讀取Cookie(即藉由瀏覽器在您使用的電腦、手機等設備中所儲存之資訊)，以紀錄及分析使用者行為，若您不願接受Cookie的寫入，您可在使用的瀏覽器功能項中設定隱私權等級為高，即可拒絕Cookie的寫入。但可能會導致本平台某些功能無法正常執行。
      </div>
      <div>
        5.本公司可能透過本服務取得您所使用的終端設備資訊（例如作業系統、終端設備之個體識別資訊，或硬體型號等），本公司蒐集您裝置資訊之目的係因用於提供較佳服務、確認是否為您本人使用、避免妨礙提供正常服務的不當行為等目的。而為分期額度評估之需要而蒐集、處理、利用或國際傳輸您本人個人資料，本公司僅於獲得您授權之情形下始會蒐集、處理、利用或國際傳輸您本人個人資料及您的裝置資訊，您可於應用程式中之設定條件自行決定是否授權，請知悉如您不同意授權，可能導致影響您分期評估之結果。
      </div>
      <div>
        6.您得自由選擇是否提供相關個人資料，惟您若拒絕提供相關個人資料，本公司將無法進行必要之審核及處理作業，致無法提供您完善之相關業務或服務。
      </div>

      <!--  -->

      <div class="text-h6 text-bold q-py-md">六、隱私權保護政策之修正：</div>
      <div>
        為落實保障隱私權之立意，本政策將因應需求，包括但不限於業務變化、法令變更、法令遵循等，隨時進行修正。修正後，將刊登於本平台或透過其他方式通知您，當您繼續使用本平台則視為您已同意經過修改之內容。您應定期閱讀本政策，以瞭解最新內容。
      </div>

      <!--  -->

      <div class="text-h6 text-bold q-py-md">七、消費者爭議處理：</div>
      <div>
        1.商品名稱、價格、內容、規格、型號及其他相關資訊，皆為您與本公司締結契約之一部分。
      </div>
      <div>
        2.廠商或個人可能透過本服務或經由本公司連結之其他網站提供商品買賣、服務或其他交易行為。您因前述買賣、服務或其他交易行為所產生之爭執，應向各該廠商或個人尋求救濟或解決之道。本公司聲明絕不介入您與廠商或個人間的任何買賣、服務或其他交易行為，對於您所獲得的商品、服務或其他交易標的物亦不負任何擔保責任。
      </div>
      <div>
        3.您一旦提出申請，即不得取消，如需取消，需於3天內賠償本公司2,000元之作業費用。
      </div>

      <!--  -->

      <div class="text-h6 text-bold q-py-md">八、智慧財產權：</div>
      <div>
        本公司相關平台所使用之軟體或程式、網站上所有內容，包括但不限於著作、圖片、檔案、資訊、資料、網站架構、網站畫面的安排、網頁設計，均由本公司或其他權利人依法擁有其智慧財產權，包括但不限於商標權、專利權、著作權、營業秘密與專有技術等。任何人不得逕自使用、修改、重製、公開播送、改作、散布、發行、公開發表等。若您欲引用或轉載前述軟體、程式或網站內容，必須依法取得本公司或其他權利人的事前書面同意，如有違反，您應對本公司負損害賠償責任。
      </div>

      <!--  -->

      <div class="text-h6 text-bold q-py-md">九、暫停服務：</div>
      <div>
        本公司以目前一般認為合理之方式及技術，維護本服務之正常運作。但於下述情況，本公司將暫停或中斷本服務之全部或一部份，如對於您有任何直接或間接之損害，均不負任何賠償或補償之責任：
      </div>
      <div>
        1.對本服務相關軟硬體設備進行搬遷、更換、升級、保養或維修並已向客戶預先通知者
      </div>
      <div>2.您違反任何政府法令或本政策情形</div>
      <div>3.天災或其他不可抗力之因素所導致之服務停止或中斷</div>
      <div>4.其他不可歸責於本公司之事由所致之服務停止或中斷</div>

      <!--  -->

      <div class="text-h6 text-bold q-py-md">
        十、法規適用、管轄法院、發布日期：
      </div>
      <div>
        1.因本政策或契約涉訟，同意以台灣新北地方法院﹝含簡易庭﹞為第一審管轄法院。
      </div>
      <div>
        2.本政策以中文發佈，如有未盡事宜，以民法、個人資料保護法及其他相關法律規定補充之。
      </div>
      <div>3.本政策如有疑義，以本公司解釋為準。</div>
      <div>4.發佈或修訂日期：中華民國110年10月20日</div>
    </q-card-section>

    <q-separator />

    <q-card-actions align="right">
      <q-btn flat label="返回" color="primary" v-close-popup />
    </q-card-actions>
  </q-card>
</template>

<script setup>
import { ref } from "vue";

const emit = defineEmits(["readed"]);

const closeDialog = () => {
  emit("readed");
};
</script>

<style scoped>
/* Add any specific styles for the dialog here */
</style>
